app/Controllers/AuthC.php

            $password = sanitize($this->request->getVar('password'));

            $userModel = new UsersM();
            $user = $userModel->where('username', $username)->first();
---
SELECT *
FROM `users`
WHERE `username` = 'dasda'
 LIMIT 1