app/Controllers/DocumentsC.php

    public function list(){
        if ($_SERVER['REQUEST_METHOD'] == 'GET') {
            return redirect()->to(base_url() . '/documents');
        }
        $docModel = new DocumentsM();
        // Para solo seleccionar algunos campos de la tabla
        //$data = $docModel->select(['docDate', 'nExp', 'subject', 'reason', 'observation', 'idUser', 'file'])->orderBy('id', 'ASC')->findAll();
        $data = $docModel->orderBy('id', 'ASC')->findAll();

        $db = \Config\Database::connect();
        $builder = $db->table("documents as d");
        $builder->select('CONCAT_WS("-", u.photo, u.name) as user, d.id, d.docDate, d.nExp, d.subject, d.reason, d.observation, d.idUser, d.file');
        $builder->join('users as u', 'd.idUser = u.id', 'inner');
        $data = $builder->get()->getResult();
---
SELECT CONCAT_WS("-", `u`.`photo`, u.name) as user, `d`.`id`, `d`.`docDate`, `d`.`nExp`, `d`.`subject`, `d`.`reason`, `d`.`observation`, `d`.`idUser`, `d`.`file`
FROM `documents` as `d`
INNER JOIN `users` as `u` ON `d`.`idUser` = `u`.`id`